---
kind: type
id: T:Autodesk.Revit.DB.BuiltInFailures.ComponentRepeaterSlotFailures
source: html/9a808b1c-8046-85bf-5dd0-3b8c7b2b676a.htm
---
# Autodesk.Revit.DB.BuiltInFailures.ComponentRepeaterSlotFailures

Failures related to component repeater slots.

## Syntax (C#)
```csharp
public static class ComponentRepeaterSlotFailures
```